[
    {"id":0,"description":"Buy an instant-read digital meat thermometer. The quickest way to ruin a perfectly marbled $25 steak? Cutting into it to figure out if it’s medium rare. Yes, the Thermapen is $95, but four steaks later, you’ve broken even."},
    {"id":1,"description":"Write in your cookbooks. Soup could have used more tomato? Chicken needed ten more minutes in the oven? Make a note of it and you’ll never make that mistake again."},
    {"id":2,"description":"Master the quick-pickle. Whisk a little salt and sugar into some white vinegar. Pour over thinly sliced raw vegetables. Wait 20 minutes. Eat."},
    {"id":3,"description":"Get your knives professionally sharpened. You may have a steel or a sharpener at home, but once a year, get a pro to revive those knives. Your chopping will get faster, more precise—and, believe it or not, safer."},
    {"id":4,"description":"Four words to live by: chicken thigh family pack. Chicken breasts are expensive and can get dull after a while; thighs are juicier, cheaper, and more flavorful."},
    {"id":5,"description":"Toss most of your spices - especially that ground cumin. Ground spices die quickly. So give them a whiff - if they don’t smell like anything, they won’t taste like anything. And if they don’t taste like anything, you’re cooking with a flavorless, brown powder."},
    {"id":6,"description":"Join a CSA. At a minimum, you’ll learn how to cook kale fifteen ways. At a maximum, you’ll broaden your culinary horizons by finding ways to use up all that fresh produce."},
    {"id":7,"description":"Replace your non-stick skillet. Do your scrambled eggs slide off the pan if you don’t use oil or butter? They should. Might be time for an upgrade."},
    {"id":8,"description":"Treat your herbs like flowers. There’s nothing worse than limp herbs. Next time, trim the stems and put the parsley in a glass of water, fit a plastic bag over it, and stash it in the refrigerator."},
    {"id":9,"description":"Get a mandoline and don’t be afraid to use it. Want gorgeous scalloped potatoes or perfectly julienned carrots? Buy a mandoline. Are you a scaredycat? Wear a cut-resistant safety glove until you feel comfortable bare-handed."},
    {"id":10,"description":"Double that batch of rice (or quinoa, or bulgar, or…) Having cooked grains in your fridge means that fried rice, pilafs, rice bowls and robust salads are just minutes away."},
    {"id":11,"description":"Make sure your work area is well lit. Look, the 40-watt lightbulb in your oven hood isn't going to cut it. Get a cheap clamp light from a hardware store so you can see what you’re doing."},
    {"id":12,"description":"Buy parchment paper. What else are you going to roast your vegetables on? How else are you going to make quick dinners of fish en papillote?"},
    {"id":13,"description":"Stock up on super-cheap, random cuts of meat. A freezer full of roasted turkey necks and bony beef cuts will ensure you always have what you need to make broth."},
    {"id":14,"description":"Keep your parmesan rinds and freeze them for later. Remember that thing about super-cheap cuts of meat? Think of rinds as cheese bones."},
    {"id":15,"description":"Buy a new kitchen sponge. Existential question time. If your sponge is filthy and smells, how can you expect it get your dishes clean?"},
    {"id":16,"description":"Put the lid on the pot to make your water boil faster. Seems obvious, but if you don’t know, now you know."},
    {"id":17,"description":"Dry your salad greens using a kitchen towel. Salad spinners? So bulky and annoying. Instead, pile your just-washed greens into a clean dish towel, gather it by the ends, and swing that sucker around until your salad is dry (or your arm is tired)."},
    {"id":18,"description":"Save the schmaltz. Chicken fat is amazing stuff, whether you’re frying onions in it, sautéing greens in it or spreading it on toast. So after eating your roast chicken dinner, drain the now-cooled liquid fat into a plastic container and store it in your freezer."},
    {"id":19,"description":"Use a garbage bowl. Hat tip to Rachael Ray. Buy a large bowl and keep it at the ready to fill up with egg shells and other trash generated while cooking."},
    {"id":20,"description":"Buy a new Y peeler. Like anecdotes about high school football games, peelers get dull, especially after a couple years. We recommend the Kuhn Rikon Swiss Peeler, which is just seven bucks."},
    {"id":21,"description":"Find the biggest mixing bowl you can and buy it. You cannot toss a salad or mix cookies or make meatballs in a tiny cereal bowl. All you can do is make a bigger mess."},
    {"id":22,"description":"Avoid evil glass cutting boards. And they’re all evil. Glass cutting boards send shivers down your spine when you use them. They dull your knives. They’re slippery. And they’re hard to use. Use wood, bamboo or plastic instead."},
    {"id":23,"description":"Buy two loaves of that awesome bread and freeze one. Bread keeps really well in the freezer. And there are always plenty of uses for it. Just remember: Air is the enemy! Wrap that loaf in foil (sliced or unsliced) and put it in a freezer bag before stashing."},
    {"id":24,"description":"Stop crowding your pans. Food that's crowded into a cast-iron skillet or sheet tray gets steamed—and soggy—instead of crisp."},
    {"id":25,"description":"Toast your spices... A quick stint in a dry skillet over medium heat wakes dry spices up and releases their oils, which means your paprika will taste a lot more paprika-y. "},
    {"id":26,"description":"Toast your nuts. “These nuts are too crunchy,” said nobody ever."},
    {"id":27,"description":"Toast also your grains. It's the first step to building roasty, warm flavor. (Using quinoa? Toast it before you rinse it.)"},
    {"id":28,"description":"Season (some of) your vegetables with sugar. Carrots, squash, tomatoes—these vegetables have a natural sweetness that’s enhanced by a dash (just a dash!) of sugar."},
    {"id":29,"description":"Don’t be afraid to set off the smoke alarm. Especially when cooking meat. Smoke equals char, and char is delicious."},
    {"id":30,"description":"Put a damp paper or kitchen towel under your cutting board. That way, your board won’t slip around as you chop."},
    {"id":31,"description":"Salt your salads. It adds texture. It makes the dressing pop. It’s proof that there’s nothing—nothing—you shouldn’t be salting."}
]